// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).

int a = 6;
Console.WriteLine(a);

if (a % 2 == 0) 
Console.WriteLine("a - четное");

else 
Console.WriteLine("a - нечетное");
